Revit 2027 API
BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurveError Property
 Cannot add the direction curve in the floor sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorCannotAddDirectionCurveError { get; }
Public Shared ReadOnly Property FloorCannotAddDirectionCurveError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorCannotAddDirectionCurveError {
	FailureDefinitionId^ get ();
}
static member FloorCannotAddDirectionCurveError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace